import React from "react";
import './About.css';

const About = () => {
    return (
        <div className="aboutContainer">
            <p className="aboutContainer__p">
                С 1891 года до самой смерти Сэмюэл Лойд утверждал, что изобрёл головоломку именно он, и долгое время считалось, что это действительно так.
                Однако существуют доказательства того, что он не был причастен ни к созданию «пятнашек», ни к вариации с переставленными фишками 14 и 15.
                Пик популярности головоломки в США пришёлся на первую половину 1880 года; при этом не было обнаружено никаких упоминаний Сэма Лойда в связи с «пятнашками»
                вплоть до января 1891 года. В частности, The New York Times дважды публиковала материалы о головоломке, 22 марта 1880 года и 11 июня 1880 года,
                ни разу не упомянув при этом Лойда, несмотря на то что Лойд жил в Нью-Йорке.

                Настоящим изобретателем головоломки был Ной Палмер Чепмэн, почтмейстер из Канастоты, который ещё в 1874 году показывал друзьям головоломку,
                состоящую из шестнадцати пронумерованных квадратиков, которые надо было сложить в ряды по четыре штуки так, чтобы сумма чисел в каждом ряду была равна 34.

                Сын Ноя Чепмэна, Фрэнк Чепмэн, привёз доработанные головоломки в Сиракузы (штат Нью-Йорк) и передал их Анне и Джеймсу Бельден (Anna and James Belden).
                Они, в свою очередь, забрали головоломку в Уотч-Хилл (Род-Айленд)[en], где были сделаны копии головоломки[14]; одна из этих копий не известным
                в точности путём попала в Хартфорд[14], где слушатели Американской школы для слабослышащих[en] начали делать грубые копии головоломки.
                К 1879 году головоломка уже продавалась не только в Хартфорде, но и в Бостоне. Тогда о «пятнашках» узнал художник по дереву Маттиас Райс (Matthias J. Rice).
                В декабре 1879 года Маттиас Райс начал в Бостоне бизнес по производству новой головоломки под названием «Драгоценная головоломка» (англ. The Gem Puzzle).

                В начале 1880 года некий Чарльз Певи, дантист из Вустера, привлёк внимание общественности, предложив денежное вознаграждение за решение задачи собирания головоломки,
                что добавило популярности новой забаве. Весной того же года игра достигла Европы.

                21 февраля 1880 года Ной Чепмэн попытался оформить патент на своё изобретение под наименованием «Block Solitaire Puzzle» («Головоломка—пасьянс с блоками»),
                однако заявка на патент была отклонена; не сохранилось записей, объясняющих, почему это произошло[22]. По-видимому, это было вызвано тем, что,
                по мнению патентного инспектора Бурке, новая заявка мало отличалась от патента[23] «Хитрые блоки», «Puzzle-Blocks», выданного Эрнесту У. Кинси (Ernest U. Kinsey)
                более чем за год до того, как Ной Чепмэн подал свою заявку.
            </p>
        </div>
    );
}

export default About;
